Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །སྟོན་པ་འདི་ལ་བརྟེན་ནས་ནི།
en: Depending on this Teacher for support,

source: །བྱང་ཆུབ་དམ་པ་འདི་རེག་ཤོག །དགེ་བའི་རྩ་བ་དེས་ན་བདག །མི་ཡི་སྲིད་པ་ཐོབ་ནས་ནི།
en: Attain this supreme awakening!’ “By this root of merit, I attained a human birth. I have pleased this caravan leader,

source: །རྫོགས་པའི་སངས་རྒྱས་བླ་མེད་པ། །དེད་དཔོན་འདི་ནི་མཉེས་པར་བྱས།
en: The Supremely, Completely Awakened One. “Having attained awakening

source: །བདག་གིས་བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་། །མྱ་ངན་འདས་པ་བསིལ་གྱུར་པའི།
en: I attained nirvāṇa,

source: །བདག་ནི་དགྲ་བཅོམ་དབང་གྱུར་ཅིང་།
en: “I am an arhat, powerful,

source: །མངོན་ཤེས་དྲུག་ལྡན་རྫུ་འཕྲུལ་ཆེ།
en: Possessing the six kinds of supernormal knowledge and great magical power.

source: །དགེ་སློང་རྣམས་ཀྱིས་བདག་ལ་ནི།
en: Monks know me

source: །གནས་འཇོག་སྦྲང་རྩི་ཅན་དུ་ཤེས།
en: As Madhuvāsiṣṭha.

source: །བསོད་ནམས་བྱས་པས་གྲགས་ལྡན་པ།
en: “Since I have made merit, possessing high repute,

source: །བདག་ནི་རྟག་ཏུ་བཀུར་ཞིང་མཆོད།
en: I am always served and venerated. Once when I traveled,

source: །དགེ་སློང་དགེ་འདུན་ཡོངས་བསྐོར་ནས། །བདག་ནི་རྒྱུ་ཞིང་སོང་བ་ན།
en: Surrounded by the community of monks,

source: །དེ་ནས་དགོན་པའི་ལམ་དུ་ནི།
en: “In the path in the wilderness

source: །དགེ་སློང་དགེ་འདུན་སྐོམ་གྱུར་ནས།
en: All the monks of the community became thirsty.

source: །དེ་ན་སེམས་ལ་སྨོན་པ་ནི།
en: There I made a wish in my mind:

source: །དེ་རིང་སྦྲང་རྩི་རྙེད་གྱུར་ཅིག །དེ་ནས་མི་མ་ཡིན་རྣམས་ཀྱིས།
en: ‘May honey be obtained today!’ “Then nonhumans brought honey

source: །བདག་སྨོན་ཤེས་ཏེ་ཕྱོགས་བཞི་ནས།
en: From all directions, knowing my wish.

source: །སྦྲང་རྩི་ཁུར་གྱིས་བླངས་ནས་ནི།
en: I received it

source: །དེ་དག་ཏུ་ནི་འབུལ་བར་བྱེད།
en: And gave it to the monks. “Having received from excellent ones

source: །བདག་གིས་སྦྲང་རྩི་ཅི་དགོས་པ། །བཟང་པོ་དག་ལས་བླངས་ནས་ནི།
en: As much honey as we needed,

source: །དགེ་སློང་དགེ་འདུན་ཚིམ་བྱས་ཏེ།
en: I satisfied the community of monks,

source: །དེ་ནས་ལྷག་པར་ལེགས་པར་གྱུར། །འདས་མ་ཐག་པའི་སྐྱེ་བ་ལ།
en: And then they were greatly content.

source: །སྤྲེའུའི་རྒྱལ་པོ་དེ་བྱས་པས།
en: “Because of what the king of the monkeys did In my directly preceding birth,

source: །ལོག་པར་ལྟུང་ནས་བདག་འཕོས་ནས།
en: Even though I had fallen into an animal life,

source: །འཆི་མེད་གོ་འཕང་རེག་གྱུར་ཏེ།
en: I died and was reborn, and attained the state of immortality.

source: །ཇི་སྐད་བདག་གིས་སྨོན་པ་ཡི།
en: “All that I wished for

source: །ཐམས་ཅད་འབྱོར་པ་ཉིད་དུ་གྱུར།
en: Has come true.

source: །སྟོན་པ་བཀུར་སྟི་བྱས་པས་འདིར།
en: Since I had served the Teacher,

source: །རང་གི་དོན་ནི་ཡོངས་སུ་རྫོགས།
en: I fully accomplished my purpose here.

source: །བཙུན་པ་བདག་གིས་དགེ་བ་གང་།
en: “O honored ones, this is the good deed

source: །བགྱིས་པ་དྲན་པ་འདི་ལགས་ཏེ།
en: That I remember performing.

source: །དེ་ཡི་འབྲས་བུ་སྡུག་པ་དང་། །བདེ་འབྱུང་འདོད་པ་ཉམས་སུ་མྱོང་།
en: I have experienced its pleasant, Desirable fruit, which causes happiness.”

source: །དེ་ལྟར་གནས་འཇོག་སྦྲང་རྩི་ཅན།
en: Thus the Elder Madhuvāsiṣṭha Explained his karma,

source: །གནས་འཇོག་སྦྲང་རྩི་ཅན་གྱི་ལེའུ་སྟེ་སུམ་བཅུ་རྩ་གཅིག་པའོ།། །།
en: Here ends the thirty-first section:

source: འདུལ་བ་གཞི། བམ་པོ་ལྔ་བཅུ་རྩ་བཞི་པ།
en: The Section of Madhuvāsiṣṭha. 2. Hetu

source: །དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་རྒྱུ་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Hetu, “O Venerable Hetu, the venerable Madhuvāsiṣṭha has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་རྒྱུ་ཅན་ཚེ་དང་ལྡན་པ་གནས་འཇོག་སྦྲང་རྩི་ཅན་གྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས། །ཚེ་དང་ལྡན་པ་རྒྱུ་ཅན་གྱིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་རྒྱུ་ཅན་གྱིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ། བཤེས་ལྡན་གྲོང་དུ་བདག་གིས་སྔོན།
en: Now you, Venerable Hetu, should also explain your karmic bond.” Then the venerable Hetu did explain his karmic bond:

source: །བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་ན།
en: “Once, ninety-one eons ago, In the city of Bandhumatī,

source: །སངས་རྒྱས་རྣམ་པར་གཟིགས་པ་ནི།
en: I saw the Buddha Vipaśyin

source: །གྲོང་ཁྱེར་དམ་པར་འཇུག་པ་མཐོང་།
en: Entering that most excellent city.

source: །ཐུགས་རྗེ་ཆེ་ལྡན་མཐོང་ནས་ནི།
en: “When I saw the one endowed with great compassion,

source: །མེ་ཏོག་སིལ་མས་གཏོར་ནས་དེར།
en: I scattered flower petals.

source: །མེ་ཏོག་རྩ་བས་ཡར་བཏེག་ཅིང་།
en: A flower took root there, arose,

source: །གྱེན་དུ་ཁ་བལྟས་ཁང་བཟངས་གནས།
en: And became like a palace, facing upward.

source: །དེ་ནས་བདག་ནི་རབ་དགའ་བས།
en: “Then, delighted,

source: །ཐུབ་པའི་ཞབས་ལ་མགོས་གཏུགས་ནས།
en: I bowed to the Muni’s feet,

source: །ཐལ་མོ་ལེགས་པར་སྦྱར་ནས་ནི།
en: Respectfully made the gesture of supplication,

source: །དེ་ལ་བསྐོར་བ་བྱས་པར་གྱུར།
en: And circumambulated him.

source: །བདག་གིས་ཆོས་ནི་མ་ཐོས་ཤིང་།
en: “Without listening to the Dharma

source: །བདག་ནི་སྐྱབས་སུ་མ་སོང་བར།
en: Or seeking refuge,

source: །སེམས་དད་ཉིད་ཅིག་བྱས་ནས་ནི།
en: My mind was filled with faith,

source: །བདེ་གཤེགས་དྲུང་ནས་བདག་སོང་ངོ་། །མཐུ་ཆེན་རྣམ་པར་གཟིགས་པ་ལ། །དགེ་བའི་ལས་དེ་བྱས་པས་ན།
en: And I departed from the presence of the Sugata. “Since I had created this good karma In honor of Vipaśyin, the one of great power, I did not know any inferior state of existence

source: །བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་ཏུ། །ངན་འགྲོ་མངོན་པར་མི་ཤེས་སོ།
en: For ninety-one eons.

source: །བདག་ནི་ལྷ་ལུས་རབ་དགའ་ཞིང་།
en: “Enjoying a divine body,

source: །ལྷ་ཡི་འདོད་པ་ཡང་དག་འབྱོར།
en: I was blessed with divine objects of desire.

source: །བདག་ནི་ནོར་ཆེན་ཕྱུག་པོར་གྱུར།
en: I was wealthy, possessing much property.

source: །ནོར་ཆེ་ལོངས་སྤྱོད་ཆེ་བ་ཡི། །བྲམ་ཟེ་རྣམས་ཀྱི་རིགས་སུ་གྱུར།
en: Endowed with much wealth and property.

source: །སྒྲ་ངེས་སྦྱོར་དང་ཤེས་གསལ་བཅས།
en: “I learned the science of language, the science of rituals,

source: །སྐྱེས་བུ་ཆེན་པོ་མཚན་དང་ནི། །ཚིག་གི་དོན་བཅས་སྟོན་པ་ཡིས།
en: The marks of a great man, And the meanings of words, And became familiar with my teacher’s mantras. “When I left my house, Surrounded by brahmins,

source: །གསང་ཚིག་རྣམས་ཀྱི་ཕ་རོལ་ཕྱིན། །བྲམ་ཟེ་ལྔ་བརྒྱ་རྣམས་ལ་ནི། །ཚལ་དུ་གསང་ཚིག་བརྗོད་པའི་ཕྱིར། །བྲམ་ཟེ་རྣམས་ཀྱིས་ཡོངས་བསྐོར་ནས། །བདག་ནི་ཁྱིམ་ནས་བྱུང་བ་ལས།
en: To teach mantras in the forest To five hundred brahmins,

source: །དགེ་སློང་དགེ་འདུན་མདུན་བདར་ནས།
en: Accompanied by the community of monks,

source: །དཔའ་བོ་ཆེན་པོ་མ་ག་དྷཱའི། །གྲོང་མཆོག་ཏུ་ནི་འཇུག་པ་མཐོང་།
en: Enter the most excellent city of Magadha.

source: །བདག་གིས་ཐུགས་རྗེ་ལྡན་མཐོང་ནས། །ཡིད་དགའ་བར་ནི་གྱུར་པ་དང་། །སྔོན་གྱི་རྒྱུ་ནི་དེ་དག་གིས། །མཚན་རྣམས་ལ་ནི་བརྟགས་པ་ལས།
en: “When I saw the compassionate one, I was pleased And examined the marks Generated by causes in the past. “I realized that he had accomplished

source: །འཇིག་རྟེན་མགོན་པོའི་མཚན་རྣམས་ནི། །སུམ་བཅུ་རྩ་གཉིས་ཡོངས་རྫོགས་ཤིང་།
en: All thirty-two marks Of the protector of the world,

source: །དཔེ་བྱད་རྣམས་ཀྱིས་མཛེས་པ་ཡི། །གྲགས་པར་ལྡན་པ་མཐོང་བར་གྱུར།
en: And was beautified with the minor marks and possessed high repute.

source: །མཚན་དང་ལྡན་པ་དེ་མཐོང་ནས།
en: “Having seen him with his marks,

source: །མགོ་བོ་ཡིས་ནི་ཕྱག་བྱས་ཏེ།
en: I bowed to him,

source: །ཕྱོགས་གཅིག་འདུག་ནས་གུས་པས་ནི།
en: Sat down to one side, and respectfully

source: །འདྲེན་པ་དེ་ལ་མངོན་བསྟོད་པ།
en: Praised the Leader:

source: །ཇི་ལྟར་གསང་ཚིག་ལ་གདའ་བ།
en: “ ‘The things taught in mantras

source: །ཁྱོད་ལ་དེ་བཞིན་དེ་གདའ་བས།
en: Lie precisely in you.

source: །ཁྱོད་སངས་རྒྱས་པར་ཐེ་ཚོམ་མེད།
en: You are undoubtedly the Buddha,

source: །འཇིག་རྟེན་གྱི་ནི་སྟོན་པ་མཆོག །ཁྱོད་ནི་ཚངས་པ་བརྒྱ་བྱིན་ཁྱོད།
en: The world’s supreme teacher. “ ‘You are Brahmā. You are Śakra.

source: །ཁྱོད་ལས་ལྷག་པ་མ་མཆིས་ཏེ།
en: There is no one surpassing you.

source: །ཁྱོད་ནི་ཉི་མ་ཁྱབ་འཇུག་ལགས།
en: You are the sun. You are Viṣṇu.

source: །ཁྱོད་ནི་འཇིག་རྟེན་བླ་ན་མེད།
en: You are the supreme one in the world.

source: །རྒྱལ་བ་ཁྱོད་འདྲའང་མ་མཐོང་ན།
en: “ ‘O Victor, no one like you has ever been seen, Nor has one surpassing you, needless to say.

source: །ལྷག་པ་ལྟ་ཞིག་ག་ལ་ཞིག །ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ན།
en: In the world including the gods,

source: །ཁྱོད་ནི་རྒྱལ་བ་བདུད་ཟིལ་ནོན།
en: You are the victor who overwhelms Māra.

source: །ཁྱོད་ནི་མགོན་མེད་རྣམས་ཀྱི་གནས།
en: “ ‘You are the resting place for masterless ones

source: །རྟེན་མེད་རྣམས་ཀྱི་སྐྱབས་ཀྱང་ལགས།
en: And also the refuge of those without support.

source: །ཁྱོད་ཀྱི་ཉན་ཐོས་ཉིད་དུ་མཆིས།
en: I will become your disciple.

source: །ཁྱོད་ནི་བདག་གི་སྐྱབས་མཛོད་ཅིག །དེ་ནས་གསེར་གྱི་མཆོད་སྡོང་ལྟའི།
en: May you become my refuge!’ “He then stretched out his hand, Which looked like a golden pillar.

source: །ཕྱག་ནི་དེ་ཡིས་བརྐྱང་མཛད་དེ། །རྒྱལ་བའི་ཕྱག་ནི་སྨད་མཛད་ནས།
en: The Victor’s hand descended,

source: །བདག་གི་མགོ་ལ་ཀུན་དུ་བྱུགས།
en: And my head was anointed with ointment.

source: །ཡིད་ནི་རབ་ཏུ་དང་བྱས་པས།
en: “He said, ‘Since your mind was filled with faith,

source: །ཁྱོད་ཀྱིས་བསོད་ནམས་མང་པོ་བསྐྱེད། །སེམས་ནི་རབ་ཏུ་དང་རྣམས་ཀྱི།
en: You generated much merit. The benefit for those whose minds are pure

source: །ཡོན་ཆུང་བར་ནི་མི་འགྱུར་རོ།
en: Will not be small.’ “ ‘You have approached

source: །ཡོན་གནས་བླ་ན་མེད་པ་ཡི།
en: The supreme field of merit, the Buddha.

source: །སངས་རྒྱས་ལ་ནི་ཁྱོད་ཀྱིས་བསྟེན། །བྲམ་ཟེ་ཁྱེའུ་ཡིས་མཆོད་སྦྱིན་བྱས།
en: You, son of a brahmin, have engaged in veneration.

source: །ཞིང་རབ་ལ་ནི་ས་བོན་བཏབ།
en: Seeds have been sown in the excellent field.

source: །ངན་སོང་གི་ནི་ལམ་བཅད་པས།
en: “ ‘Since you have destroyed the path to inferior states of existence,

source: །ཁྱོད་ལ་ངན་འགྲོའི་འཇིགས་པ་མེད།
en: You need not fear such inferior modes of existence.

source: །བྲམ་ཟེ་ཁྱེའུ་ཡིས་བདུད་རྩི་ཡིས།
en: You, son of a brahmin, should open

source: །སྒོ་ཕྱེ་བར་ནི་དོགས་མེད་བྱོས།
en: The gate of immortality without a doubt.

source: །ཁྱོད་ནི་རབ་ཏུ་འབྱུང་འདོད་ན།
en: “ ‘If you wish to go forth,

source: །རལ་པ་ཀུན་ནི་མྱུར་སྤངས་ཏེ།
en: You should quickly remove your hair

source: །ང་ཡི་སྤྱན་སྔར་རབ་བྱུང་ལ།
en: And go forth in my presence.

source: །བྲམ་ཟེ་ཐ་བ་མེད་པར་གྱིས།
en: Brahmin, be free from coarseness.’

source: །བདག་ནི་ཆོས་ཉིད་ལ་དགའ་ནས།
en: “I was pleased with the nature of the Dharma.

source: །དེ་ན་སློབ་མའི་ཚོགས་སྨྲ་བ།
en: There, my disciples said,

source: །ཁྱོད་ནི་བྲམ་ཟེར་གྱུར་ཟིན་ན། །ཇི་ལྟར་དགེ་སྦྱོང་མགོ་རེག་འགྱུར།
en: ‘Why are you becoming a shaven-headed śramaṇa When you were born a brahmin?

source: །དཀར་པོའི་རིགས་འདི་སྤངས་ནས་ནི།
en: “ ‘Are you abandoning this white family lineage

source: །ནག་པོའི་རིགས་འདི་ཁས་ལེན་ནམ།
en: And choosing that dark family lineage?

source: །འཇིག་རྟེན་ན་ནི་བྲམ་ཟེ་གཙོ།
en: In this world, brahmins are masters, Perfect ones, ones who were born

source: །ཕ་རོལ་ཕྱིན་ཅིང་ཚངས་པ་ཡི། །སྙིང་དང་ཁ་ནས་སྐྱེས་པ་ཡིན།
en: From the heart and mouth of Brahmā.

source: །བྲམ་ཟེ་ཚངས་པས་སྤྲུལ་པ་ཡིན།
en: Brahmins were produced by Brahmā.’

source: །ཁྱེད་ཅག་ཀུན་ནི་མི་མཁས་པ།
en: “I said, ‘You are all unintelligent.

source: །ཁྱེད་ཅག་ཀུན་ནི་མི་ཤེས་པ།
en: You are all ignorant.

source: །འདི་ན་བདག་ཅི་གསང་ཚིག་གི།
en: Here, only I know the nature of mantras

source: །དེ་ཉིད་རིག་ཅིང་ཕ་རོལ་ཕྱིན།
en: And am perfect.

source: །བདག་ནི་ཤེས་རབ་མཐའ་ཡས་ཀྱིས།
en: “ ‘I will do just

source: །གསུངས་པ་ཇི་ལྟར་ཤེས་པ་བཞིན།
en: As I understand the words

source: །དེ་བཞིན་དུ་ནི་བདག་བྱེད་ཀྱིས།
en: Of the one whose wisdom is limitless.

source: །གང་དག་དེར་འགྲོ་མི་འདོད་པ།
en: Those who do not wish to go there “ ‘Can go anywhere

source: །ཅི་སེམས་ཇི་ལྟར་འདོད་པ་བཞིན།
en: They would like.

source: །གར་དགའ་དེར་ནི་འདེང་ལ་རག །བདག་ནི་གསང་ཚིག་དོན་མི་གཉེར།
en: I do not seek mantras

source: །ལྟོས་པར་ཡང་ནི་མི་བྱེད་དོ།
en: Or take them as an authority.’

source: །དེ་ནས་བདག་གི་སློབ་མའི་ཚོགས།
en: “Then my disciples,

source: །མཆི་མས་བརྣངས་ཤིང་ངུ་བཞིན་གྱིས།
en: Choking with tears,

source: །སྙིང་ནི་རྗེ་རྗེ་སྐད་སྨྲས་ནས།
en: Addressed me in piteous voices

source: །དེ་ནས་དེ་རྣམས་ཕྱོགས་ཕྱོགས་དོང་།
en: And then left in every direction.

source: །དེ་ནས་ཐུགས་རྗེ་ཆེ་ལྡན་པའི།
en: “Thereupon the Muni, Who possesses great compassion,

source: །ཐུབ་པས་བདག་ལ་གསུངས་པ་ནི།
en: Spoke to me:

source: །དགེ་སློང་ཚུར་ཤོག་བཀའ་སྩལ་པས།
en: ‘Come, monk,’

source: །ཁྱིམ་རྣམས་ནས་ནི་ཁྱིམ་མེད་པར། །ཡང་དག་དད་པས་རབ་ཏུ་བྱུང་།
en: From my home into homelessness.

source: །སངས་རྒྱས་བསྟན་པ་ཆུབ་བྱས་ནས།
en: Having understood what the Buddha taught,

source: །མངོན་པར་ཤེས་ཀུན་རེག་གྱུར་ཏེ།
en: I accomplished all kinds of superhuman knowledge.

source: །སྔོན་གྱི་གནས་ནི་རྗེས་སུ་དྲན།
en: “I recalled my past lives.

source: །ལྷ་ཡི་མིག་ནི་རྣམ་པར་དག །བདག་སྔོན་གང་ན་འདུག་པ་ཡི།
en: I purified my divine sight.

source: །འཆི་འཕོ་སྐྱེ་བ་ཤེས་པར་གྱུར།
en: I realized my death and rebirth— Where I was in the past.

source: །ཟག་པ་ཟད་པ་ཐོབ་པས་ན།
en: Having succeeded in exhausting impurities,

source: །བདག་གིས་རྫུ་འཕྲུལ་མངོན་དུ་བྱས།
en: I realized magical power.”

source: །དེ་ལྟར་གནས་བརྟན་རྒྱུ་ཅན་གྱིས།
en: Thus the Elder Hetu Explained his karma,

source: །གནས་བརྟན་རྒྱུ་ཅན་གྱི་ལེའུ་སྟེ་སུམ་བཅུ་རྩ་གཉིས་པའོ།། །།
en: Here ends the thirty-second section: The Section of Hetu. 3. Kauṇḍinya

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀཽཎྜི་ནྱ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Kauṇḍinya, “O Venerable Kauṇḍinya, the venerable Hetu has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་ཀཽཎྜི་ནྱ་ཚེ་དང་ལྡན་པ་རྒྱུ་ཅན་གྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Kauṇḍinya, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་ཀཽཎྜི་ནྱས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀཽཎྜི་ནྱས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Kauṇḍinya did explain his karmic bond:

source: སྔོན་ནི་ཐུབ་ཆེན་འོད་སྲུང་གི །དམ་པའི་ཆོས་ནི་ནུབ་པ་ན།
en: “Once when the true Dharma Of the great Muni Kāśyapa had declined,

source: །ཉན་ཐོས་ཐམས་ཅད་འདུས་ནས་སུ།
en: All his disciples met together

source: །ཕན་ཚུན་དག་ཏུ་སྨྲས་པ་ནི།
en: And said to each other, “ ‘Because of the nirvāṇa

source: །སྟོན་པ་ཐུགས་རྗེ་འོད་སྲུང་ནི། །མྱ་ངན་འདས་པས་ངེས་པར་ཡང་།
en: Of the compassionate teacher Kāśyapa,

source: །རབ་ཏུ་བྱུང་བ་སྲབ་གྱུར་ཅིང་།
en: Certainly the number of mendicants will decrease,

source: །དམ་ཆོས་ཀྱང་ནི་སྟོན་མི་འགྱུར།
en: And the true Dharma will no longer be taught. “ ‘Let us demonstrate to each other

source: །བདག་ཅག་ཇི་སྐད་ཐོས་པའི་ཆོས། །ཕན་ཚུན་ཡང་དག་གསལ་བྱས་ནས།
en: The Dharma as we have heard it,

source: །སངས་རྒྱས་བསྟན་ལས་སྤྲོ་བ་དང་། །བརྩོན་འགྲུས་བརྩམ་པས་གནས་པར་བྱ།
en: Encourage ourselves in the Buddha’s teachings, And continue exerting ourselves.’

source: །དེ་དག་རི་ལ་འཛེགས་ནས་ནི། །ཟག་པ་ཟད་པ་མ་ཐོབ་པར། །རེ་ཞིག་འདི་ནས་མི་ལྡང་ཞེས།
en: “They climbed a mountain And, saying, ‘For the time being, we will not rise from here Until we have exhausted our defilements,’

source: །རྩྭ་ཡི་གདིང་བ་དག་ལ་འཁོད།
en: Sat down on clean grass mats. “When they were exerting themselves

source: །སྲོག་ལ་ཡང་ནི་མི་ལྟ་བར། །བརྩོན་འགྲུས་བརྩམས་ཏེ་གནས་པ་ན།
en: Without regard for their lives,

source: །བདུན་གྱིས་མངོན་པར་ཤེས་ལ་རེག །དགེ་སློང་དག་ནི་མྱ་ངན་འདས།
en: Six attained supernormal knowledge, And those monks were emancipated.

source: །དེ་ཡི་བདུན་པ་བདག་ཡིན་ཏེ།
en: “I was the seventh.

source: །དབང་པོ་བརྟུལ་ཞིང་བསོད་ནམས་ཆུང་། །སྙོམས་མེད་སྦྱོར་ལ་བརྩོན་པ་ཡི།
en: Of dull faculties and less merit,

source: །སོ་སོའི་སྐྱེ་བོ་འཆི་དུས་བྱས།
en: I died as an ordinary man,

source: །བདག་གིས་བརྩོན་འགྲུས་མ་བཏང་ཞིང་།
en: In spite of my tireless exertions.

source: །དེ་བཞིན་རབ་ཏུ་བརྩོན་གནས་པས།
en: “As I thus kept endeavoring

source: །དགའ་ལྡན་རྣམས་དང་སྐལ་མཉམ་པའི།
en: Without giving up my efforts,

source: །ལྷ་ཡི་འཇིག་རྟེན་རྣམས་སུ་སྐྱེས།
en: I was born in the world Of the gods of the Tuṣita heaven.

source: །དེ་ན་ཤཱཀྱ་སེང་གེ་ཡི།
en: “There I saw the Lion of the Śākyans,

source: །ཐུབ་ཆེན་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་།
en: The Great Muni, the Bodhisattva. The Muni preached

source: །ཐུབ་པ་ལྷ་ཡི་ཚོགས་ལ་ནི། །སྐྱོ་བར་འགྱུར་བའི་ཆོས་སྟོན་མཛད།
en: The inspiring Dharma to the gods.

source: །བདག་གིས་དེ་ཡི་ཆོས་བཤད་པ། །ཐོས་ནས་རྩེ་གཅིག་ཡིད་གྱུར་ཏེ།
en: “Having heard his Dharma preached, I became attentive

source: །དམ་ཆོས་ཡིད་ལ་བྱེད་པ་ནི། །ལན་འགའང་རྣམ་པར་མ་སྤངས་སོ།
en: And never gave up Concentrating the mind on the true Dharma.

source: །ལྷ་ཡི་འཇིག་རྟེན་བདག་སོན་ནས།
en: “After I left the world of the gods,

source: །གྲོང་ཁྱེར་སེར་སྐྱ་ཞེས་བྱ་བའི།
en: I was born in a city called Kapilavastu,

source: །ཀཽཎྜི་ནྱ་རུས་བྲམ་ཟེ་ཡི།
en: Among the Kauṇḍinyas,

source: །རིགས་ཅན་དུ་ནི་སྐྱེས་པར་གྱུར།
en: Who belong to the brahmin race.

source: །བྱང་ཆུབ་སེམས་དཔའི་གྲགས་ཆེན་ལྡན།
en: “The Bodhisattva, renowned

source: །ཟས་གཙང་སྲས་པོར་གྱུར་ནས་ནི།
en: As the son of Śuddhodana,

source: །དད་པས་བྱུང་ནས་དཀའ་སྤྱོད་པ།
en: Left his home out of faith

source: །སྤྱད་པར་གྱུར་པ་དེ་ཡི་ཚེ།
en: And became an ascetic. At that time,

source: །རྒྱལ་པོའི་མཆོག་ནི་ཟས་གཙང་གིས།
en: “Śuddhodana, the best of kings,

source: །བདག་བཀུག་ནས་ཀྱང་སྨྲས་པ་ནི།
en: Summoned me and exhorted me,

source: །རབ་ཏུ་འབྱུང་བར་འདོད་པར་གྱིས།
en: ‘May you wish to go forth

source: །དེར་ནི་དེ་ཡི་ནད་གཡོག་བྱོས།
en: And take care of him!’

source: །དེ་ཚེ་བདག་གིས་ཡིད་དད་པས།
en: “Then, with a pure mind,

source: །བྱང་ཆུབ་སེམས་དཔའི་རིམ་གྲོ་བྱས།
en: I attended on the Bodhisattva. But he left after this thought came to his mind:

source: །ལམ་འདིའི་རྣམ་དག་འགྱུར་མིན་ཞེས། །ཡིད་བྱུང་ནས་ནི་གཤེགས་པར་གྱུར།
en: ‘This path does not lead to purity.’

source: །གང་ཚེ་ཤཱཀྱ་ཐུབ་པས་ནི།
en: “When Śākyamuni

source: །ཀུན་གྱི་ཐོག་མར་བདག་གིས་ནི།
en: I was the first

source: །དེ་ཡི་དམ་ཆོས་རྟོགས་པར་གྱུར།
en: To understand the true Dharma. “I led the pure life

source: །འོད་སྲུང་གི་ནི་གསུང་རབ་ལ། །ཚངས་པར་སྤྱོད་ལ་བདག་གིས་གནས།
en: In Kāśyapa’s dispensation.

source: །སངས་རྒྱས་བདག་གིས་མཉེས་བྱས་ཤིང་།
en: I pleased the Buddha

source: །ཟག་པ་ཟད་པ་ཐོབ་པར་གྱུར།
en: And succeeded in exhausting impurities.”

source: །དེ་ལྟར་གནས་བརྟན་ཀཽཎྜི་ནྱས།
en: Thus the Elder Kauṇḍinya Explained his karma,

source: །ཀཽཎྜི་ནྱའི་ལེའུ་སྟེ་སུམ་བཅུ་རྩ་གསུམ་པའོ།། །།
en: Here ends the thirty-third section: The Section of Kauṇḍinya. 4. Upālin

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཉེ་བ་འཁོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Upālin, “O Venerable Upālin, the venerable Kauṇḍinya has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་ཉེ་བ་འཁོར་ཚེ་དང་ལྡན་པ་ཀཽཎྜི་ནྱས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Upālin, should also explain your karmic bond.”

source: །ཚེ་དང་ལྡན་པ་ཉེ་བ་འཁོར་གྱིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །ཚེ་དང་ལྡན་པ་ཉེ་བ་འཁོར་གྱིས་ཀྱང་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Upālin did explain his karmic bond:

source: བདག་ནི་སྔོན་གྱི་ཚེ་རབས་ན།
en: “In a past life,

source: །བཱ་རཱ་ཎ་སཱིའི་རྒྱལ་ཁབ་ཏུ།
en: In the royal palace in Vārāṇasī I was the barber

source: །རྒྱལ་པོ་ཚངས་སྦྱིན་ཞེས་བྱ་བའི།
en: Of a king named Brahmadatta.

source: །འདྲེག་མཁན་དུ་ནི་གྱུར་པ་ན།
en: “I used to cut and arrange

source: །དེ་ཡི་སྐྲ་དང་ཁ་སྤུ་རྣམས།
en: His hair and beard,

source: །འདྲེག་ཅིང་འཆོས་པར་བྱེད་པ་ན།
en: And perfume his clothes.

source: །དེ་ནས་མངོན་པར་རངས་གྱུར་ནས།
en: This delighted me.

source: །བགོ་བདག་ནི་བདག་ལ་བྱིན།
en: “I attended on the king

source: །གུས་དང་བཅས་པའི་སྡུག་སེམས་ཀྱིས། །རྒྱལ་པོའི་རིམ་གྲོ་བྱེད་པ་ན།
en: With a respectful, affectionate mind.

source: །མཉེས་ནས་དེ་ནས་དེ་ལ་ནི།
en: Satisfied, then, I chanted verses there,

source: །མ་ཐོས་པ་ཡི་ཚིགས་བཅད་བསྒྲགས།
en: Which had never been heard before:

source: །འདོད་པ་རྣམས་ནི་མནོག་ཆུང་ཞིང་།
en: “ ‘Objects of desire are useless,

source: །སྡིག་པའི་རྩ་དང་མྱ་ངན་རྩ།
en: Roots of evil, roots of sorrow.

source: །རྣམ་པར་སྨིན་པ་རྩུབ་པ་ཡིན།
en: The maturation of karma is severe.

source: །བྲམ་ཟེའི་ཁྱེའུ་ནི་གང་ཞིག་གིས།
en: “ ‘If a young brahmin,

source: །འདོད་པའི་ཡོན་ཏན་སྤངས་ནས་ནི།
en: Rejecting the qualities of desire,

source: །རབ་བྱུང་ཐོབ་པ་ལེགས་ཐོབ་ཡིན།
en: Succeeds in going forth, he will have attained a boon.’

source: །མ་ཐོས་ཚིགས་བཅད་དེས་ཐོས་ནས།
en: “Having heard these verses that had never been heard,

source: །དེ་ནས་སྐྱོ་བར་གྱུར་པ་དང་། །རྒྱལ་པོ་བདག་ནི་གནང་བར་མཛོད།
en: He was then moved. I said, ‘May you, O King, allow me

source: །ཁྱིམ་མ་མཆིས་པར་རབ་འབྱུང་ངོ་།
en: To go forth into homelessness!’

source: །དེ་ནས་རྒྱལ་པོས་བདག་ལ་སྨྲས།
en: “The king then said to me,

source: །གལ་ཏེ་རབ་ཏུ་བྱུང་ནས་ཀྱང་།
en: ‘If you go forth, You should promise

source: །ཕྱིར་ཀྱང་བདག་ལ་ལྟ་བ་ཡི། །ཁས་བླང་བ་ནི་བྱ་བའི་རིགས།
en: To meet me again later.’

source: །རྒྱལ་དབང་ཁྱོད་ལ་བདག་གིས་ནི།
en: “ ‘O Victorious One, I swear to you

source: །དེ་བཞིན་བགྱི་བར་དམ་བཅའ་ཡིས།
en: I will do just as you have ordered.

source: །བདག་རབ་བྱུང་ནས་སླར་ཡང་ནི།
en: After going forth, I will meet you again.

source: །ལྟ་བར་བདག་ལ་ཐུགས་ཆེས་མཛོད།
en: Trust me.’

source: །དེ་ནས་རྒྱལ་པོས་གནང་ནས་ནི།
en: “Then the king allowed it,

source: །བདག་གིས་དགོན་པའི་ནགས་སོང་ནས།
en: And I went to a forest in the wilderness.

source: །གཞུང་ཅན་དྲུང་དུ་ཉེར་སོང་སྟེ།
en: I approached a master

source: །ཇི་ལྟར་རིགས་པར་རབ་བྱུང་ནས།
en: “Having properly gone forth, I practiced the

source: །ཚངས་པའི་གནས་པ་བཞི་པོ་ཡི། །ཚད་མེད་པ་ལ་རབ་བསྒོམས་པས།
en: Four immeasurable pure abodes,

source: །རྒྱལ་པོ་དེ་ཡི་ཚེ་ལ་ནི།
en: “During that king’s reign,

source: །དེ་ཚེ་བདག་མིང་གང་གཱ་སྐྱོང་། །འབྱོར་པ་ཆེ་ཞིང་མཐུ་ཡང་ཆེ།
en: I, whose name was Gaṅgāpāla,

source: །སྐྱེ་བོའི་ཚོགས་ཀྱིས་མཆོད་པར་གྱུར།
en: Was venerated by the people As one possessed of great majesty and power.

source: །གཞུང་ཅན་དྲུང་དུ་སོང་ནས་ནི།
en: “Having gone to the master,

source: །བདག་གིས་ཕྱོགས་གཅིག་འདུག་ནས་ནི།
en: And sat down to one side,

source: །འདི་སྐད་ཀྱི་ནི་ཚིག་སྨྲས་སོ།
en: I spoke these words:

source: །སློབ་དཔོན་བདག་གི་ཚིག་གསོན་ཅིག །མི་ཡི་དབང་པོ་ཚངས་སྦྱིན་ལ།
en: “ ‘Teacher, please listen to my words. I have made a promise To the master of the people, Brahmadatta,

source: །སླར་ཡང་ལྟ་བར་བགྱི་བ་ཡི། །དམ་བཅས་པ་ནི་ཆུང་ཞིག་མཆིས།
en: To meet him again.’

source: །གནང་བར་བྱའོ་བྲམ་ཟེ་ཁྱོད།
en: “ ‘You are allowed, O brahmin,

source: །བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་སོང་།
en: To go to the city of Vārāṇasī. Carry out your promise

source: །ཁྱོད་ནི་བརྫུན་དུ་མི་འགྱུར་བར།
en: So that you will not be a liar.

source: །དམ་བཅས་པ་ཡི་མཐར་ཕྱུང་ཤིག །གནང་བར་བྱ་ཡིས་ཁྱོད་སོང་ལ།
en: “ ‘You go, for you are allowed to.

source: །ཁོ་བོ་ཡི་ནི་ཚིག་བཞིན་གྱིས།
en: In accordance with my words,

source: །འདི་ནས་སོང་ལ་མི་དབང་པོ།
en: Go from here and make the master of the people,

source: །ཚངས་སྦྱིན་དད་པ་སྐྱེད་པར་གྱིས།
en: Brahmadatta, increase his faith.’

source: །གཞུང་ཅན་གྱིས་ནི་བདག་གནང་ནས།
en: “Having been allowed by the master,

source: །དྲང་སྲོང་བསྐོར་བ་བྱས་ནས་ནི། །བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་དུ། །རིམ་བཞིན་དུ་ནི་སོང་བ་ལས། །དེ་བཞིན་དེར་ནི་བདག་འོངས་ཞེས།
en: And having circumambulated the ṛṣi, I went in due course To the city of Vārāṇasī.

source: །ཚངས་སྦྱིན་ཉིད་ཀྱིས་ཐོས་ནས་ནི།
en: “When Brahmadatta heard That I had arrived there,

source: །རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོས་ནི། །བདག་གི་དྲུང་དུ་ཉེ་བར་འོངས།
en: He came to me, Displaying great royal wealth.

source: །ཤིང་རྟ་ལས་བབས་བདག་གི་ནི།
en: “Having alighted from the carriage,

source: །རྐང་པ་གཉིས་ལ་ཕྱག་བྱས་ནས།
en: He bowed low until his forehead touched my feet,

source: །ཕྱོགས་གཅིག་ཏུ་ནི་འདུག་པར་གྱུར།
en: And then he sat down to one side. I preached to him the Dharma

source: །འདོད་པ་རྣམས་ལས་རྒལ་འགྱུར་བའི།
en: For being liberated from desires.

source: །དེ་ལ་ཆོས་ནི་བཤད་པ་དང་། །རྒྱལ་པོས་ཐོས་ནས་ཡིད་དགའ་བས།
en: “Having heard it, the king was delighted

source: །འདོད་པ་དོན་དུ་མི་གཉེར་གྱུར།
en: And quit seeking the objects of desire.

source: །རྒྱ་ཆེའི་སེམས་དང་ཡིད་དགའ་བས།
en: “With vast joy,

source: །ཚངས་སྦྱིན་གྱིས་ནི་འདི་སྐད་སྨྲས།
en: Brahmadatta thus said, ‘I too will go forth,

source: །བདག་འདོད་དོན་དུ་གཉེར་མིན་པས།
en: For I am not a seeker after the objects of desire.’ “ ‘O King, come!

source: །བདག་ཀྱང་རབ་ཏུ་འབྱུང་བར་བྱ།
en: Depart for solitary

source: །རྒྱལ་པོ་ཚུར་སྤྱོན་དགོན་པའི་ནགས།
en: Forests in the wilderness.

source: །དབེན་པ་དག་ཏུ་བཞུད་པར་བགྱི།
en: Depart to approach
